#include<stdio.h>
/*
指针 +- 整数的运算
*/
// int main()
// {
//     int a[5] = {1,2,3,4,5};
//     int *ptr = (int*)(&a + 1);//&a + 1 表示跳过这个数组的地址a
//     printf("%d,%d\n", *(a+1), *(ptr -1));//地址a -1 ==> 该数组最后一个元素地址 == ptr - 1
//     return 0;
// }

// struct Test//结构体指针
// {
//     int Num;
//     char *pcName;
//     short sDate;
//     char cha[2];
//     short sBa[4];
// }* p;
// //假设p 的值为0x100000, 如下表达式的值分别是多少
// //已知：结构体Test类型的变量大小是20个字节

// int main()
// {
//     p = (struct Test*)0x00100000;
//     printf("%p\n", p + 0x1); // == p + 1 == 0x100020  跳过一个类型变量

//     printf("%p\n", (unsigned long)p + 0x1);// 强转成整型十进制：1048576 + 1 = 1048577 == 0x100001
//     printf("%p\n", (unsigned int*)p + 0x1);// 强转成无符号整型指针 + 1 跳过一个整型指针类型 + 4 == 0x100004
//     return 0;
// }

// int main()
// {
//     //小端存储
//     //01000000 02000000 03000000 04000000 ==》a数组的地址
//     int a[4] = {1, 2, 3, 4};
//     int *ptr1 = (int *)(&a + 1);// ptr1 的位置 是a数组最后一位+1
//     int *ptr2 = (int *)((int)a + 1);
//     //假设a的起始地址是0x00 00 00 05 ==》强转成int型 ==》5然后加1 ==》6 ==》找到他的地址 0x00 00 00 06
//     //相当于ptr2地址是：a的起始地址加1个字节 ==> 01   000000 02000000
//     //*ptr2 = 0x02000000
//     printf("%x,%x\n", ptr1[-1], *ptr2);
//     //ptr1[-1] ==> *(ptr1 + (-1)) ==> *(ptr1 - 1) ==> 4 ==> 0x4
    
//     return 0;
// }

// int main()
// {
//     //(0,1)逗号表达式表示最后一位数 ==》1
//     //相当于 = {1, 3, 5};
//     int a[3][2] = {(0, 1), (2, 3), (4, 5)};
//     int *p;
//     p = a[0];
//     printf("%d", p[0]);

//     return 0;
// }

int main()
{
    int a[5][5];
    int(*p)[4];
    p = a;//两边类型：int(*)[4] <---> int(*)[5]
    printf("%p, %d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]);
    //p[4][2] ==> *(*(p + 4) + 2)
    //30.50 P42 见图解
    return 0;
}