//==========数据在内存中的存储==============
/*
C语言类型
    内置类型： char short int long long long float double
        整型家族：
            char
                unsigned char 0 - 255
                signed char -128 - 127
            short
                unsigned short[int]
                signed short [int]
            int 
                unsigned int
                signed int
            long
                unsigned long
                signed long
        浮点型家族：
            float
            double
    自定义构造类型：
        数组类型 int arr[10]; int[10]
        结构体类型 struct
        枚举类型 enum
        联合类型 union
    指针类型：
        int* pi;
        char* pc;
        float* pf;
        void* pv;
    空类型：
        void 表示空类型 就是无类型
        通常应用于函数的返回类型，函数的参数，指针类型
*/
//=============整型在内存中的存储=========
/*
整型（整数）：数据存放在内存的是补码
    原码 反码 补码
        有符号位， 正数：原反补相同。负数：0为负 1为正
        无符号位： 原反补相同
大端存储模式：倒着存 数据的低位保存内存高地址中，数据的高位保存在内存的低地址
小端存储模式：正着存 数据的高位保存内存低地址中，数据的低位保存在内存的高地址
*/
#include<stdio.h>
// void test()
// {
//     printf("hehe\n");
// }
// int main()
// {
//     // short int a = 10;
//     // short b = 10;
//     test(100);
//     return 0;
// }

// int main()
// {
//     int a = 20;
//     //00000000000000000000000000010100 -原码
//     //00000000000000000000000000010100 -反码
//     //00000000000000000000000000010100 -补码
//     //0x00000014   

//     int b = -10;
//     //10000000000000000000000000001010 -原码
//     //11111111111111111111111111110101 -反码
//     //1111 1111 1111 1111 1111 1111 1111 0110 -补码
//     //0xfffffff6
//     return 0;
// }

// int main()
// {
//     int a = 1 - 1;
//     // 1 + (-1)
//     //00000000000000000000000000000001
//     //11111111111111111111111111111111
//     //1 00000000000000000000000000000000 -- 1是的第33位 丢去
//     // 1
//     //00000000000000000000000000000001 - 补码
//     // -1
//     //10000000000000000000000000000001 - 原码
//     //11111111111111111111111111111110 - 反码
//     //11111111111111111111111111111111 - 补码
// }

int main()
{
    int a = 0x11223344;
    printf("%p\n", &a);
}